const formHoroskop = document.querySelector('#formHoroskop');
const divHoroskopBox = document.querySelector('#divHoroskopBox');
const divHoroskopParagraph = document.querySelector('#divHoroskopParagraph');


const select = document.createElement('select');
formHoroskop.append(select);

const zodiakArray = [
    {
        zodiakName: 'Овен',
        horoskop: 'Овен вірний одному алкогольному напою остаточно життя. У відносинах вони менше відданості, ніж до алкоголю. До того ж овени дуже вперті, тому не варто намагатися змусити їх спробувати щось нове - марно! Найчастіше овени вибирають міцні напої, і досить відомі: коньяк, віскі. Овни, звичайно, позбавляють себе можливості поринути з головою в дивовижний алкогольний світ.'
    },
    {
        zodiakName: 'Телець',
        horoskop: 'Зірки до тельців не дуже прихильні. Мабуть це єдиний знак зодіаку, якому всі небесні астрологічні світила забороняють пити. Ну, можна, але зовсім небагато і благородні напої. Справа в тому, що тельці найбільше інших знаків зодіаку схильні до алкоголізму. І особливо обережно слід обходитися тельцям з горілкою – це найгірший для них алкогольний варіант.'
    },
    {
        zodiakName: 'Близнюки',
        horoskop: 'Близнюки при виборі алкогольного напою є консервативними. Однак воліють не аби якесь вино, а престижний, елітний алкоголь. Якщо вони мають можливість його купити, зрозуміло. Але все ж таки близнюки можуть змінити свої уподобання. Щоправда, у тому рідкісному випадку, якщо їх улюблений алкогольний напій несподівано перестануть виробляти чи постачати. До речі, близнюки можуть бути непоганими дегустаторами, тому що є тонкими поціновувачами хороших напоїв.'
    },
    {
        zodiakName: 'Рак',
        horoskop: 'Рак любить легкі напої - ігристі вина, шампанське. Грайливому характеру подавай грайливі напої. Рак, він же все робить із задоволенням, навіть п\’є. Але міру треба знати! Алкоголь зазвичай заспокоює нервову систему раків, але у помірних кількостях. В іншому випадку, підвищується тривожність раків, а це не дуже приємно.'
    },
    {
        zodiakName: 'Лев',
        horoskop: 'Найчастіше леви зупиняють свій вибір на бурбоні (дуже привабливо звучить для них назва) або на сухих шляхетних винах. Можна порадити левам  напої, які ефектно подаються. Скажімо, самбуку. Напій, що горить, кавове зернятко - все це неодмінно приведе лева в захват.  Але левам краще не напиватися, інакше вони втрачають контроль над своїми емоціями, і можуть наговорити купу дурниць.'
    },
    {
        zodiakName: 'Діва',
        horoskop: 'З алкоголем у діви легкі стосунки: вона зовсім не прив\ʼязується ні до чого, тому може пити, що завгодно і скільки завгодно. Головне — не  що пити, а з ким. Так, хороша компанія для діви важливіша, ніж якість та смак алкоголю. Але тут слід бути обережним: з печінкою не жартують!  До речі, спокійні діви, трохи перебравши, можуть стати абсолютно некерованими. Так що акуратніше там із алкоголем.'
    },
    {
        zodiakName: 'Терези',
        horoskop: 'Терези ніколи не п\’ють заради того, щоб напитися. І, до речі, вони напиваються вкрай рідко. І навіть якщо це трапляється, то, мабуть, впливає на скорпіонів на краще: вони стають ще товариськими. Словом, терези — добрий товариш по чарці!'
    },
    {
        zodiakName: 'Скорпіон',
        horoskop: 'Скорпіони акуратні, стежать за своїм здоров\’ям, тому до алкоголю ставляться з великою обережністю. При цьому скорпіони великі любителі всього витонченого, вишуканого. Те саме стосується і алкогольних напоїв. Скорпіони швидше виберуть щось витончене, ніж просту горілку.'
    },
    {
        zodiakName: 'Стрілець',
        horoskop: 'Стрільці, варто визнати, — володарі гарного смаку. Особливо у тому, що стосується алкоголю. І вони дуже люблять похизуватися своїми нестандартними смаками, тому нерідко віддають перевагу чилійським або новозеландським винам. Але мода є мода, та й виділитися з натовпу ваги завжди не проти. Зірки ж радять стрільцям вибирати сливові вина: вони зможуть налаштувати цих негідників на поетичний лад. Головне, не перестаратися, а то й муза піде, і голова розболиться.'
    },
    {
        zodiakName: 'Козеріг',
        horoskop: 'Для козерогів ідеально сухе вино, хоча самі вони із задоволенням випили б що міцніше. Головне правило, яке повинні пам\’ятати козероги: "не мішати червоне з білим". Втім, правило для підвищення градуса теж ніхто не скасовував. Козерогам в цілому слід бути акуратнішими з алкоголем, в якому вони часто шукають можливість позбутися всіх своїх розчарувань.'
    },
    {
        zodiakName: 'Водолій',
        horoskop: 'Для водоліїв важливим є все: обстановка, якість алкоголю, компанія. Водолії й у напоях шукають собі подібних – сильних, міцних, із агресивним насиченим смаком. Жодної солодкості! І пити більшість напоїв водолії воліють у чистому вигляді. Бажано, дорогі та з відмінним смаком. Тоді водолій буде задоволений. Отже, якщо водолій п\’є, то лише добрі напої.'
    },
    {
        zodiakName: 'Риби',
        horoskop: 'Риби при виборі алкогольного напою є консервативними. Однак риби воліють не аби якесь вино, а престижний, елітний алкоголь. Якщо вони мають можливість його купити, зрозуміло. Але все ж таки риби можуть змінити свої уподобання. Щоправда, у тому рідкісному випадку, якщо його улюблений алкогольний напій несподівано перестануть виробляти чи постачати. До речі, риби можуть бути непоганими дегустаторами, тому що є тонкими поціновувачами хороших напоїв.'
    }

]


const makeOption = function () {
    for (let i = 0; i < zodiakArray.length; i++) {
        let zodiak = zodiakArray[i];
        const option = document.createElement('option');

        option.value = i;

        option.innerText = zodiak.zodiakName;

        select.append(option);
    }
}

const makeButton = function () {
    const buttonSeeHoroskop = document.createElement('button');
    buttonSeeHoroskop.classList.add('buttonSee');
    buttonSeeHoroskop.innerText = ('Подивитись гороскоп');
    formHoroskop.append(buttonSeeHoroskop);

    buttonSeeHoroskop.addEventListener('click', function (e) {

        e.preventDefault();
    
        let zodiakIndex = select.options[select.selectedIndex].value;
        let zodiak = zodiakArray[zodiakIndex];
    
        showHoroskop(zodiak)
    })
}

const showHoroskop = function (zodiak) {
    divHoroskopParagraph.innerText ='';
    const paragraph = document.createElement('p');
    paragraph.innerText = zodiak.horoskop;
    divHoroskopParagraph.append(paragraph);
}

makeOption();
makeButton();
